25-rails-review/app/views/users/show.html.erb

<ul>
  <% @user.locations.each do |location| %>
---
SELECT "locations".* FROM "locations" INNER JOIN "visits" ON "locations"."id" = "visits"."location_id" WHERE "visits"."user_id" = ?  [["user_id", 1]]