36-rails-api/cats-backend/app/controllers/cats_controller.rb

    def index
        cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def create
        kitty = Cat.create(cat_params)
---
INSERT INTO "cats" ("name", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"