36-rails-api/cats-backend/app/controllers/hobbies_controller.rb

    def index
        hobbies = Hobby.all
---
SELECT "hobbies".* FROM "hobbies"