25-rails-review/app/views/visits/new.html.erb

  <%= v.label :user %>
  <%= v.collection_select(:user_id, User.all, :id, :name) %><br />
  <%= v.label :location %>
  <%= v.collection_select(:location_id, Location.all, :id, :name) %>
---
SELECT "users".* FROM "users"
SELECT "locations".* FROM "locations"