25-rails-review/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ryan"], ["created_at", "2019-12-02 17:13:30.590656"], ["updated_at", "2019-12-02 17:13:30.590656"]]

  def update
      @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Ryan!!!"], ["updated_at", "2019-12-02 17:18:46.641745"], ["id", 4]]

  def find_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]