25-rails-review/app/controllers/visits_controller.rb

  def create
    @visit = Visit.create(strong_params)
---
INSERT INTO "visits" ("user_id", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["location_id", 1], ["created_at", "2019-12-02 17:58:06.050653"], ["updated_at", "2019-12-02 17:58:06.050653"]]